Revit 2026 API

# BuiltInFailuresViewPositionFailuresCantMoveViewport Property

---

Can't move Viewport when its placement is controlled by the assigned View Position.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FailureDefinitionId CantMoveViewport { get; }
```
```vb
Public Shared ReadOnly Property CantMoveViewport As FailureDefinitionId
	Get
```
```cpp
public:
static property FailureDefinitionId^ CantMoveViewport {
	FailureDefinitionId^ get ();
}
```
```fsharp
static member CantMoveViewport : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId

#### Reference

BuiltInFailuresViewPositionFailures Class

Autodesk.Revit.DB Namespace